dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.esp32-core-claim
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary prints the overflowing task name
# instead of aborting silently. Original ESP32 has no assist-debug module
# (SOC_ASSIST_DEBUG_SUPPORTED is unset), so CONFIG_ESP_SYSTEM_HW_STACK_GUARD
# isn't available here -- pair with the end-of-stack hardware watchpoint for
# deterministic (not sampled-at-context-switch) detection. See
# components/bb_health/Kconfig.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_BB_LOG_ROUTES=y
CONFIG_BB_OTA_PULL_AUTOREGISTER=y
# Enable RST-based SSE abort teardown (B1-517): bb_http_req_async_abort's
# SO_LINGER{on,0} setsockopt is inert without this — see bb_http.h.
CONFIG_LWIP_SO_LINGER=y
# Compile+boot gate for the synthetic core-claimer proof harness (B1-1364
# PR5 validation, examples/smoke/main/smoke_core_claim.c). Default n; a
# no-op stub compiles in when off (every other smoke env is unaffected).
# With this on, smoke_core_claim_start() claims a core EXCLUSIVELY via
# bb_task_create()'s core_owning=true path (components/bb_task) BEFORE
# bb_http_server_ensure_started() runs, so httpd's worker-core steering
# (platform/espidf/bb_http_server/bb_http.c) actually executes on-target
# instead of remaining dormant -- see examples/smoke/main/Kconfig.projbuild.
CONFIG_BB_SMOKE_CORE_CLAIM=y
# Claim core 1 (default) -- httpd (no explicit CONFIG_BB_HTTP_TASK_CORE_ID
# pin, also default here) should steer to core 0.
CONFIG_BB_SMOKE_CORE_CLAIM_CORE=1
